GopalSaraf/Practicals/PSDL/include/proc/pic16f17146.h
extern volatile OPA1OFFSETbits_t OPA1OFFSETbits __at(0x911);
// bitfield macros
#define _OPA1OFFSET_OFFSET_POSN                             0x0
#define _OPA1OFFSET_OFFSET_POSITION                         0x0
#define _OPA1OFFSET_OFFSET_SIZE                             0x8
#define _OPA1OFFSET_OFFSET_LENGTH                           0x8
#define _OPA1OFFSET_OFFSET_MASK                             0xFF
#define _OPA1OFFSET_OFFSET0_POSN                            0x0
#define _OPA1OFFSET_OFFSET0_POSITION                        0x0
#define _OPA1OFFSET_OFFSET0_SIZE                            0x1
#define _OPA1OFFSET_OFFSET0_LENGTH                          0x1
#define _OPA1OFFSET_OFFSET0_MASK                            0x1
#define _OPA1OFFSET_OFFSET1_POSN                            0x1
#define _OPA1OFFSET_OFFSET1_POSITION                        0x1
#define _OPA1OFFSET_OFFSET1_SIZE                            0x1
#define _OPA1OFFSET_OFFSET1_LENGTH                          0x1
#define _OPA1OFFSET_OFFSET1_MASK                            0x2
#define _OPA1OFFSET_OFFSET2_POSN                            0x2
#define _OPA1OFFSET_OFFSET2_POSITION                        0x2
#define _OPA1OFFSET_OFFSET2_SIZE                            0x1
#define _OPA1OFFSET_OFFSET2_LENGTH                          0x1
#define _OPA1OFFSET_OFFSET2_MASK                            0x4
#define _OPA1OFFSET_OFFSET3_POSN                            0x3
#define _OPA1OFFSET_OFFSET3_POSITION                        0x3
#define _OPA1OFFSET_OFFSET3_SIZE                            0x1
#define _OPA1OFFSET_OFFSET3_LENGTH                          0x1
#define _OPA1OFFSET_OFFSET3_MASK                            0x8
#define _OPA1OFFSET_OFFSET4_POSN                            0x4
#define _OPA1OFFSET_OFFSET4_POSITION                        0x4
#define _OPA1OFFSET_OFFSET4_SIZE                            0x1
#define _OPA1OFFSET_OFFSET4_LENGTH                          0x1
#define _OPA1OFFSET_OFFSET4_MASK                            0x10
#define _OPA1OFFSET_OFFSET5_POSN                            0x5
#define _OPA1OFFSET_OFFSET5_POSITION                        0x5
#define _OPA1OFFSET_OFFSET5_SIZE                            0x1
#define _OPA1OFFSET_OFFSET5_LENGTH                          0x1
#define _OPA1OFFSET_OFFSET5_MASK                            0x20
#define _OPA1OFFSET_OFFSET6_POSN                            0x6
#define _OPA1OFFSET_OFFSET6_POSITION                        0x6
#define _OPA1OFFSET_OFFSET6_SIZE                            0x1
#define _OPA1OFFSET_OFFSET6_LENGTH                          0x1
#define _OPA1OFFSET_OFFSET6_MASK                            0x40
#define _OPA1OFFSET_OFFSET7_POSN                            0x7
#define _OPA1OFFSET_OFFSET7_POSITION                        0x7
#define _OPA1OFFSET_OFFSET7_SIZE                            0x1
#define _OPA1OFFSET_OFFSET7_LENGTH                          0x1
#define _OPA1OFFSET_OFFSET7_MASK                            0x80
#define _OPA1OFFSET_OPA1OFFSET_POSN                         0x0
#define _OPA1OFFSET_OPA1OFFSET_POSITION                     0x0
#define _OPA1OFFSET_OPA1OFFSET_SIZE                         0x8
#define _OPA1OFFSET_OPA1OFFSET_LENGTH                       0x8
#define _OPA1OFFSET_OPA1OFFSET_MASK                         0xFF
#define _OPA1OFFSET_OPA1OFFSET0_POSN                        0x0
#define _OPA1OFFSET_OPA1OFFSET0_POSITION                    0x0
#define _OPA1OFFSET_OPA1OFFSET0_SIZE                        0x1
#define _OPA1OFFSET_OPA1OFFSET0_LENGTH                      0x1
#define _OPA1OFFSET_OPA1OFFSET0_MASK                        0x1
#define _OPA1OFFSET_OPA1OFFSET1_POSN                        0x1
#define _OPA1OFFSET_OPA1OFFSET1_POSITION                    0x1
#define _OPA1OFFSET_OPA1OFFSET1_SIZE                        0x1
#define _OPA1OFFSET_OPA1OFFSET1_LENGTH                      0x1
#define _OPA1OFFSET_OPA1OFFSET1_MASK                        0x2
#define _OPA1OFFSET_OPA1OFFSET2_POSN                        0x2
#define _OPA1OFFSET_OPA1OFFSET2_POSITION                    0x2
#define _OPA1OFFSET_OPA1OFFSET2_SIZE                        0x1
#define _OPA1OFFSET_OPA1OFFSET2_LENGTH                      0x1
#define _OPA1OFFSET_OPA1OFFSET2_MASK                        0x4
#define _OPA1OFFSET_OPA1OFFSET3_POSN                        0x3
#define _OPA1OFFSET_OPA1OFFSET3_POSITION                    0x3
#define _OPA1OFFSET_OPA1OFFSET3_SIZE                        0x1
#define _OPA1OFFSET_OPA1OFFSET3_LENGTH                      0x1
#define _OPA1OFFSET_OPA1OFFSET3_MASK                        0x8
#define _OPA1OFFSET_OPA1OFFSET4_POSN                        0x4
#define _OPA1OFFSET_OPA1OFFSET4_POSITION                    0x4
#define _OPA1OFFSET_OPA1OFFSET4_SIZE                        0x1
#define _OPA1OFFSET_OPA1OFFSET4_LENGTH                      0x1
#define _OPA1OFFSET_OPA1OFFSET4_MASK                        0x10
#define _OPA1OFFSET_OPA1OFFSET5_POSN                        0x5
#define _OPA1OFFSET_OPA1OFFSET5_POSITION                    0x5
#define _OPA1OFFSET_OPA1OFFSET5_SIZE                        0x1
#define _OPA1OFFSET_OPA1OFFSET5_LENGTH                      0x1
#define _OPA1OFFSET_OPA1OFFSET5_MASK                        0x20
#define _OPA1OFFSET_OPA1OFFSET6_POSN                        0x6
#define _OPA1OFFSET_OPA1OFFSET6_POSITION                    0x6
#define _OPA1OFFSET_OPA1OFFSET6_SIZE                        0x1
#define _OPA1OFFSET_OPA1OFFSET6_LENGTH                      0x1
#define _OPA1OFFSET_OPA1OFFSET6_MASK                        0x40
#define _OPA1OFFSET_OPA1OFFSET7_POSN                        0x7
#define _OPA1OFFSET_OPA1OFFSET7_POSITION                    0x7
#define _OPA1OFFSET_OPA1OFFSET7_SIZE                        0x1
#define _OPA1OFFSET_OPA1OFFSET7_LENGTH                      0x1
#define _OPA1OFFSET_OPA1OFFSET7_MASK                        0x80

// Register: OPA1ORS
#define OPA1ORS OPA1ORS
extern volatile unsigned char           OPA1ORS             __at(0x912);
#ifndef _LIB_BUILD
asm("OPA1ORS equ 0912h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ORS                    :8;
    };
    struct {
        unsigned ORS0                   :1;
        unsigned ORS1                   :1;
        unsigned ORS2                   :1;
        unsigned ORS3                   :1;
        unsigned ORS4                   :1;
    };
    struct {
        unsigned OPA1ORS                :8;
    };
    struct {
        unsigned OPA1ORS0               :1;
        unsigned OPA1ORS1               :1;
        unsigned OPA1ORS2               :1;
        unsigned OPA1ORS3               :1;
        unsigned OPA1ORS4               :1;
    };
} OPA1ORSbits_t;
extern volatile OPA1ORSbits_t OPA1ORSbits __at(0x912);
// bitfield macros
#define _OPA1ORS_ORS_POSN                                   0x0
#define _OPA1ORS_ORS_POSITION                               0x0
#define _OPA1ORS_ORS_SIZE                                   0x8
#define _OPA1ORS_ORS_LENGTH                                 0x8
#define _OPA1ORS_ORS_MASK                                   0xFF
#define _OPA1ORS_ORS0_POSN                                  0x0
#define _OPA1ORS_ORS0_POSITION                              0x0
#define _OPA1ORS_ORS0_SIZE                                  0x1
#define _OPA1ORS_ORS0_LENGTH                                0x1
#define _OPA1ORS_ORS0_MASK                                  0x1
#define _OPA1ORS_ORS1_POSN                                  0x1
#define _OPA1ORS_ORS1_POSITION                              0x1
#define _OPA1ORS_ORS1_SIZE                                  0x1
#define _OPA1ORS_ORS1_LENGTH                                0x1
#define _OPA1ORS_ORS1_MASK                                  0x2
#define _OPA1ORS_ORS2_POSN                                  0x2
#define _OPA1ORS_ORS2_POSITION                              0x2
#define _OPA1ORS_ORS2_SIZE                                  0x1
#define _OPA1ORS_ORS2_LENGTH                                0x1
#define _OPA1ORS_ORS2_MASK                                  0x4
#define _OPA1ORS_ORS3_POSN                                  0x3
#define _OPA1ORS_ORS3_POSITION                              0x3
#define _OPA1ORS_ORS3_SIZE                                  0x1
#define _OPA1ORS_ORS3_LENGTH                                0x1
#define _OPA1ORS_ORS3_MASK                                  0x8
#define _OPA1ORS_ORS4_POSN                                  0x4
#define _OPA1ORS_ORS4_POSITION                              0x4
#define _OPA1ORS_ORS4_SIZE                                  0x1
#define _OPA1ORS_ORS4_LENGTH                                0x1
#define _OPA1ORS_ORS4_MASK                                  0x10
#define _OPA1ORS_OPA1ORS_POSN                               0x0
#define _OPA1ORS_OPA1ORS_POSITION                           0x0
#define _OPA1ORS_OPA1ORS_SIZE                               0x8
#define _OPA1ORS_OPA1ORS_LENGTH                             0x8
#define _OPA1ORS_OPA1ORS_MASK                               0xFF
#define _OPA1ORS_OPA1ORS0_POSN                              0x0
#define _OPA1ORS_OPA1ORS0_POSITION                          0x0
#define _OPA1ORS_OPA1ORS0_SIZE                              0x1
#define _OPA1ORS_OPA1ORS0_LENGTH                            0x1
#define _OPA1ORS_OPA1ORS0_MASK                              0x1
#define _OPA1ORS_OPA1ORS1_POSN                              0x1
#define _OPA1ORS_OPA1ORS1_POSITION                          0x1
#define _OPA1ORS_OPA1ORS1_SIZE                              0x1
#define _OPA1ORS_OPA1ORS1_LENGTH                            0x1
#define _OPA1ORS_OPA1ORS1_MASK                              0x2
#define _OPA1ORS_OPA1ORS2_POSN                              0x2
#define _OPA1ORS_OPA1ORS2_POSITION                          0x2
#define _OPA1ORS_OPA1ORS2_SIZE                              0x1
#define _OPA1ORS_OPA1ORS2_LENGTH                            0x1
#define _OPA1ORS_OPA1ORS2_MASK                              0x4
#define _OPA1ORS_OPA1ORS3_POSN                              0x3
#define _OPA1ORS_OPA1ORS3_POSITION                          0x3
#define _OPA1ORS_OPA1ORS3_SIZE                              0x1
#define _OPA1ORS_OPA1ORS3_LENGTH                            0x1
#define _OPA1ORS_OPA1ORS3_MASK                              0x8
#define _OPA1ORS_OPA1ORS4_POSN                              0x4
#define _OPA1ORS_OPA1ORS4_POSITION                          0x4
#define _OPA1ORS_OPA1ORS4_SIZE                              0x1
#define _OPA1ORS_OPA1ORS4_LENGTH                            0x1
#define _OPA1ORS_OPA1ORS4_MASK                              0x10

// Register: NVMADR
#define NVMADR NVMADR
extern volatile unsigned short          NVMADR              __at(0x1C8C);
#ifndef _LIB_BUILD
asm("NVMADR equ 01C8Ch");
#endif

// Register: NVMADRL
#define NVMADRL NVMADRL
extern volatile unsigned char           NVMADRL             __at(0x1C8C);
#ifndef _LIB_BUILD
asm("NVMADRL equ 01C8Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMADR                 :8;
    };
    struct {
        unsigned NVMADR0                :1;
        unsigned NVMADR1                :1;
        unsigned NVMADR2                :1;
        unsigned NVMADR3                :1;
        unsigned NVMADR4                :1;
        unsigned NVMADR5                :1;
        unsigned NVMADR6                :1;
        unsigned NVMADR7                :1;
    };
} NVMADRLbits_t;
extern volatile NVMADRLbits_t NVMADRLbits __at(0x1C8C);
// bitfield macros
#define _NVMADRL_NVMADR_POSN                                0x0
#define _NVMADRL_NVMADR_POSITION                            0x0
#define _NVMADRL_NVMADR_SIZE                                0x8
#define _NVMADRL_NVMADR_LENGTH                              0x8
#define _NVMADRL_NVMADR_MASK                                0xFF
#define _NVMADRL_NVMADR0_POSN                               0x0
#define _NVMADRL_NVMADR0_POSITION                           0x0
#define _NVMADRL_NVMADR0_SIZE                               0x1
#define _NVMADRL_NVMADR0_LENGTH                             0x1
#define _NVMADRL_NVMADR0_MASK                               0x1
#define _NVMADRL_NVMADR1_POSN                               0x1
#define _NVMADRL_NVMADR1_POSITION                           0x1
#define _NVMADRL_NVMADR1_SIZE                               0x1
#define _NVMADRL_NVMADR1_LENGTH                             0x1
#define _NVMADRL_NVMADR1_MASK                               0x2
#define _NVMADRL_NVMADR2_POSN                               0x2
#define _NVMADRL_NVMADR2_POSITION                           0x2
#define _NVMADRL_NVMADR2_SIZE                               0x1
#define _NVMADRL_NVMADR2_LENGTH                             0x1
#define _NVMADRL_NVMADR2_MASK                               0x4
#define _NVMADRL_NVMADR3_POSN                               0x3
#define _NVMADRL_NVMADR3_POSITION                           0x3
#define _NVMADRL_NVMADR3_SIZE                               0x1
#define _NVMADRL_NVMADR3_LENGTH                             0x1
#define _NVMADRL_NVMADR3_MASK                               0x8
#define _NVMADRL_NVMADR4_POSN                               0x4
#define _NVMADRL_NVMADR4_POSITION                           0x4
#define _NVMADRL_NVMADR4_SIZE                               0x1
#define _NVMADRL_NVMADR4_LENGTH                             0x1
#define _NVMADRL_NVMADR4_MASK                               0x10
#define _NVMADRL_NVMADR5_POSN                               0x5
#define _NVMADRL_NVMADR5_POSITION                           0x5
#define _NVMADRL_NVMADR5_SIZE                               0x1
#define _NVMADRL_NVMADR5_LENGTH                             0x1
#define _NVMADRL_NVMADR5_MASK                               0x20
#define _NVMADRL_NVMADR6_POSN                               0x6
#define _NVMADRL_NVMADR6_POSITION                           0x6
#define _NVMADRL_NVMADR6_SIZE                               0x1
#define _NVMADRL_NVMADR6_LENGTH                             0x1
#define _NVMADRL_NVMADR6_MASK                               0x40
#define _NVMADRL_NVMADR7_POSN                               0x7
#define _NVMADRL_NVMADR7_POSITION                           0x7
#define _NVMADRL_NVMADR7_SIZE                               0x1
#define _NVMADRL_NVMADR7_LENGTH                             0x1
#define _NVMADRL_NVMADR7_MASK                               0x80

